var mbti_question = [
  "1.你倾向从何处得到力量：",//题目1
  "2.当你参加一个社交聚会时，你会",
  "3.下列那一件事听起来比较吸引你",
  "4.在约会中，你通常",
  "5.过去，你遇见你大部分的情人是",
  "6.你倾向拥有：",
  "7.过去，你的爱人和情人倾向对你说",
  "8.你倾向通过一下哪种方式收集信息",
  "9.你倾向相信：",
  "10.当你置身于一段关系中时，你倾向相信",
  "11.当你对一个约会觉得放心时，你偏向谈论",
  "12.你是这种人",
  "13.你是这类型的人",
  "14.你通常",
  "15.你倾向如此做决定",
  "16.你倾向比较能够察觉到",
  "17.当和某人分手时",
  "18.当与一个人交往时，你倾向于看重",
  "19.当你不同意情人的想法时",
  "20.认识你的人倾向形容你为",
  "21.你认为自己和很多人的相遇是",
  "22.若你有时间和金钱，你的朋友邀请你到国外度假，并且在前一天才通知，你会",
  "23.在第一次约会中",
  "24.你偏好",
  "25.你选择的生活充满着",
  "26.哪一项较常见",
  "27.你是这种喜欢……的人",
  "28.你是此类型的人"
]

var mbti_ans = [
  { ans1: "别人", ans2: "自己的想法", },//题目1
  { ans1: "在夜色很深时，一旦你开始投入，也许就是最晚离开的那一个", ans2: "在夜晚刚开始的时候，我就疲倦了并且想回家", },//2
  { ans1: "与情人到很多人且社交活动频繁的地方", ans2: "待在家中与情人做一些特别的事情，例如说观赏一部有趣的录影带并享用你最喜欢的外卖食物", },//3
  { ans1: "整体来说很健谈", ans2: "较安静并保留，直到你觉得舒服", },//4
  { ans1: "在宴会中、夜总会、工作上、休闲活动中、会议上或当朋友介绍我给他们的朋友时", ans2: "通过私人的方式，例如个人广告、录影约会，或是由亲密的朋友和家人介绍", },//5
  { ans1: "很多认识的人和很亲密的朋友", ans2: "一些很亲密的朋友和一些认识的人", },//6
  { ans1: "你难道不可以安静一会儿吗", ans2: "可以请你从你的世界中出来一下吗", },//7
  { ans1: "你对有可能发生之事的想象和期望", ans2: "你对目前状况的实际认知", },//8
  { ans1: "你的直觉", ans2: "你直接的观察和现成的经验", },//9
  { ans1: "永远有进步的空间", ans2: "若它没有被破坏，不予修补", },//10
  { ans1: "未来，关于改进或发明事物和生活的种种可能性。例如，你也许会谈论一个新的科学发明，或一个更好的方法来表达你的感受", ans2: "实际的、具体的、关于“此时此地”的事物。例如，你也许会谈论品酒的好方法，或你即将要参加的新奇旅程", },//11
  { ans1: "喜欢先纵观全局", ans2: "喜欢先掌握细节", },//12
  { ans1: "与其活在现实中，不如活在想象里", ans2: "与其活在想象里，不如活在现实中", },//13
  { ans1: "偏向于去想象一大堆关于即将来临的约会的事情", ans2: "偏向于拘谨地想象即将来临的约会，只期待让它自然地发生", },//14
  { ans1: "首先依你的心意，然后依你的逻辑", ans2: "首先依你的逻辑，然后依你的心意", },//15
  { ans1: "当人们需要情感上的支持时", ans2: "当人们不合逻辑时", },//16
  { ans1: "你通常让自己的情绪深陷其中，很难抽身出来", ans2: "虽然你觉得受伤，但一旦下定决心，你会直截了当地将过去恋人的影子甩开", },//17
  { ans1: "情感上的相容性：表达爱意和对另一半的需求很敏感", ans2: "智慧上的相容性：沟通重要的想法；客观地讨论和辩论事情", },//18
  { ans1: "你尽可能地避免伤害对方的感情；若是会对对方造成伤害的话，你就不会说。", ans2: "你通常毫无保留地说话，并且对情人直言不讳，因为对的就是对的", },//19
  { ans1: "热情和敏感", ans2: "逻辑和明确", },//20
  { ans1: "随意的，友善及重要的", ans2: "经过思考的，或多或少有一定目的性", },//21
  { ans1: "必须先检查你的时间表", ans2: "立刻收拾行装", },//22
  { ans1: "若你所约的人来迟了，你会很不高兴", ans2: "一点儿都不在乎，因为你自己常常迟到", },//23
  { ans1: "事先知道约会的行程：要去哪里、有谁参加、你会在那里多久、该如何打扮", ans2: "让约会自然地发生，不做太多事先的计划", },//24
  { ans1: "日程表和组织", ans2: "自然发生和弹性", },//25
  { ans1: "你准时出席而其他人都迟到", ans2: "其他人都准时出席而你迟到", },//26
  { ans1: "下定决心并且做出最后肯定的结论", ans2: "放宽你的选择面并且持续收集信息", },//27
  { ans1: "喜欢在一段时间里专心于一件事情直到完成", ans2: "享受同时进行好几件事情", }//28
]
//加分规则的数组。以第一行规则为例，type的字符为J表示主项是J，副项是P，btype为true表示如果选了ans1那么主项（J）值加1。
var mbti = [
  {type: "E", },//1
  {type: "E", },
  {type: "E", },
  {type: "E", },
  {type: "E", },
  {type: "E", },
  {type: "E", },
  {type: "N", },//8
  {type: "N", },
  {type: "N", },
  {type: "N", },
  {type: "N", },
  {type: "N", },
  {type: "N", },
  {type: "F", },//15
  {type: "F", },
  {type: "F", },
  {type: "F", },
  {type: "F", },
  {type: "F", },
  {type: "F", },
  {type: "E", },//22
  {type: "J", },
  {type: "J", },
  {type: "J", },
  {type: "J", },
  {type: "J", },
  {type: "J", }//28
]

module.exports.mbti_question = mbti_question;
module.exports.mbti_ans = mbti_ans;
module.exports.mbti = mbti;

